[
    {
        "url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/kedake-inc-issues-allergy-alert-undeclared-sesame-soy-wheat-yellow-no-5-yellow-no-6-and-red-no-6",
        "company_announcement": "KEDAKE, INC. of Houston, TX is recalling it’s 2 lb packages of Las Ollas Botana Mix Snacks because they may contain undeclared Sesame, Soy, Wheat, Yellow No 5, Yellow No 6, and Red No 6. People who have an allergy or severe sensitivity to Sesame, Soy, Wheat, Yellow No 5, Yellow No 6 and Red No 6, run the risk of serious or life-threatening allergic reaction if they consume these products. Las Ollas Botana Mix Snacks 2 lb packages were distributed in Texas and reached consumers through both wholesale and retail stores. The product is not available on-line. The product can be identified as packaged in a plastic bag with a pink and white label displaying the name “Botana Mix Snacks and Delights” with the Las Ollas brand label. The bag clearly states 2 lb on the front. Nutrition facts and ingredients are also listed on the front of the package. There is a UPC on the front as well. The expiration date is on the back of the package. No illnesses have been reported to date. The recall was initiated after the FDA discovered in a routine inspection that the product containing the Sesame, Soy, Wheat, Yellow No 5, Yellow No 6, and Red No 6 was distributed in packaging that did not reveal the presence of these ingredients and subsequent investigation indicated that the problem was caused by a production printing problem with the label. Consumers who have purchased the 2 lb packages of Botana Mix Snacks are urged to return them to the place of purchase for a full refund. Consumers with questions may contact Kedake, Inc. at 713-996-7550. (Monday-Friday 7:00am -5:00pm CST) Kedake, Inc.",
        "product_images": [],
        "product_details": {
            "Company Announcement Date": "February 20, 2025",
            "FDA Publish Date": "February 20, 2025",
            "Product Type": "Food & BeveragesAllergens",
            "Reason for Announcement": "Recall Reason DescriptionUndeclared wheat, sesame, soy, yellow 5, yellow 6, red 6",
            "Company Name": "Kedake Inc",
            "Brand Name": "Brand Name(s)Las Ollas",
            "Product Description": "Product DescriptionLas Ollas Botana Mix Snacks and Delights 2 lb packages"
        }
    },
    {
        "url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/kayco-issues-allergy-alert-undeclared-milk-limited-units-glicks-dark-chocolate-conettos",
        "company_announcement": "Bayonne, NJ. (February 21st, 2025) – Kayco, a Bayonne NJ company is recalling their Glicks Dark Chocolate Conettos because it may contain undeclared milk. People who have an allergy or severe sensitivity to milk, run the risk of serious or life-threatening allergic reaction if they consume these products. The Glicks Dark Chocolate Conettos were distributed to stores nationwide, predominately located in the New York, New Jersey and Connecticut regions, during the weeks of October 13th, 2024 through February 14th, 2025. Some units were sold on Amazon.com. This recall was initiated after the company was notified by their Quality Control Department that a limited number of bags labeled as “Dark Chocolate Conettos” contained Milk Chocolate Conettos, which contains milk allergen that is not declared on the label. Only packages bearing the Lot Code below, may potentially have milk Conettos in the “darkchocolate Conettos” bag. The company has received no reports of illness or injury to date. We immediately informed all retailers who had purchased this lot code about this recall and instructed them to inspect their inventory or remove any potential affected product on their shelves. Consumers who may have purchased this product are advised to inspect their product for the affected Lot Code 02092024. Consumers may return the product for credit or refund. If a consumer experiences an allergic reaction they are urged to report to a medical provider. Consumers who have questions may contact us atCustomercare@kayco.comor by phone at 718-369-4600 Monday through Friday 9 AM to 5PM Eastern Time. This recall is being made with the knowledge of the Food and Drug Administration.",
        "product_images": [
            "https://www.fda.gov/files/styles/recall_image_small/public/image_1_66.png?itok=vqc_5Kzn"
        ],
        "product_details": {
            "Company Announcement Date": "February 21, 2025",
            "FDA Publish Date": "February 21, 2025",
            "Product Type": "Food & BeveragesAllergens",
            "Reason for Announcement": "Recall Reason DescriptionUndeclared milk allergen",
            "Company Name": "Kayco",
            "Brand Name": "Brand Name(s)Glicks",
            "Product Description": "Product DescriptionDark Chocolate Conettos"
        }
    },
    {
        "url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/little-leaf-farms-announces-limited-voluntary-withdrawal-specific-lot-code-southwest-salad-kit-due",
        "company_announcement": "Little Leaf Farms is voluntarily recalling a specific lot code of its Southwest Salad Kits due to the potential presence of undeclared fish and wheat allergens. People who have an allergy or severe sensitivity to wheat and/or fish run the risk of serious or life-threatening allergic reaction if they consume these products. The affected product was produced during a single run on Wednesday, February 19, 2025, resulting in one pallet of 96 cases (576 individual clamshells). Little Leaf Farms has determined that fewer than 20 individual Southwest Salad Kits were incorrectly assembled during this run. Product was distributed to the following states: Massachusetts, Connecticut, and New Hampshire. The Southwest Salad Kits were distributed to retail stores including Ahold USA Freetown, Kilduff, Stew Leonard’s, Associated Grocers of New England, Shapiro Produce, and C&S Wholesale Grocers, Inc (Hatfield) between February 20, 2025, and February 22, 2025. The recalled product is identified as follows: Consumers who may have purchased the potentially affected Southwest Salad Kits with this lot number are asked to return it to the place of purchase for a full refund or immediately dispose of them. Little Leaf Farms is advising affected retailers in its distribution network to remove existing products with the above-identified lot code from their shelves and warehouses. The issue was identified after receiving one consumer complaint noting incorrect ingredients. No injuries or illnesses have been reported to date. While the products are safe to eat and the company believes the issue is extremely limited, it is taking this measure to ensure the safety of its consumers. Consumers with questions should contact Little Leaf Farms Consumer Relations at (844) LIL-LEAF, Monday- Friday 9-12pm, 1:30-5pm EST, or email us athello@littleleaffarms.com.",
        "product_images": [
            "https://www.fda.gov/files/styles/recall_image_small/public/llf-sw-05001.png?itok=cIIOhkPm"
        ],
        "product_details": {
            "Company Announcement Date": "February 28, 2025",
            "FDA Publish Date": "March 01, 2025",
            "Product Type": "Food & Beverages",
            "Reason for Announcement": "Recall Reason DescriptionUndeclared fish and wheat allergen",
            "Company Name": "Little Leaf Farms",
            "Brand Name": "Brand Name(s)Little Leaf Farms",
            "Product Description": "Product DescriptionSouthwest Salad Kits"
        }
    },
    {
        "url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/zb-importing-issue-voluntary-recall-and-allergy-alert-undeclared-egg-wheat-and-milk-certain-ulker",
        "company_announcement": "ZB Importing LLC is voluntarily recalling certain lots of six varieties of Ulker Brand snack rolls, biscuits, and wafers due to undeclared wheat, egg and/or milk in the Ingredient List and/or Contains Statement on the product labels. People who have an allergy or severe sensitivity to wheat, egg, or milk run the risk of a serious or life-threatening allergic reaction if they consume these products. Products were distributed through retail stores in Ontario, Canada and the following US states AL, AR, CA, CT, CO, DC, DE, FL, GA, IL, IN, KY, LA, MA, MD, MI, MN, MO, MS, NE, NC, NH, NJ, NM, NY, OH, OK, PA, RI, SC, TN, TX, VA, WA, WI and WV. This mislabeling was discovered following receipt of a single consumer complaint involving an allergic reaction. The issue originated from a supplier who inadvertently failed to fully disclose all allergens while translating the ingredient list. We are actively working with the supplier to implement stricter labeling controls, including an additional verification process for multilingual labels. Consumers who have purchased any of the below Ulker Brand products are urged to return them to the place of purchase for a full refund. Consumers with questions may contact the company atinfo@ziyad.com. SeeProduct List",
        "product_images": [],
        "product_details": {
            "Company Announcement Date": "February 18, 2025",
            "FDA Publish Date": "February 20, 2025",
            "Product Type": "Food & BeveragesAllergens",
            "Reason for Announcement": "Recall Reason DescriptionUndeclared allergen (wheat, eggs, milk)",
            "Company Name": "ZB Importing LLC",
            "Brand Name": "Brand Name(s)Ulker",
            "Product Description": "Product DescriptionSnack rolls, biscuits, and wafers"
        }
    },
    {
        "url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/lyons-magnus-recalls-lyons-readycare-and-sysco-imperial-frozen-supplemental-shakes-manufactured",
        "company_announcement": "Lyons Magnus LLC (\"Lyons Magnus\") today announced that it is voluntarily recalling 4 oz. Lyons ReadyCare and Sysco Imperial Frozen Supplemental Shakes due to the potential for the products to be contaminated withListeria monocytogenes. Lyons Magnus is taking this action in response to a recall of the products by their manufacturer, Prairie Farms Dairy, Inc. (\"Prairie Farms\") from the Prairie Farms facility in Fort Wayne, Indiana. Listeria monocytogenesis an organism which can cause serious and sometimes fatal infections in young children, frail or elderly people, and others with weakened immune systems. Although healthy individuals may suffer only short-term symptoms such as high fever, severe headache, stiffness, nausea, abdominal pain and diarrhea,Listeriainfection can cause miscarriages and stillbirths among pregnant women. Lyons Magnus handled distribution of the recalled products, which were manufactured and supplied to Lyons Magnus by Prairie Farms. The recalled products were distributed primarily to long-term care facilities and were not available for retail sale. As soon as Lyons Magnus learned of the issue, it took immediate action to halt the purchase of all products from the affected Prairie Farms facility, notify customers, and ensure that impacted products were removed from distribution nationally. Lyons Magnus' utmost concern is protecting consumers. The recalled products were distributed throughout the United States and packed in 4 oz. cartons under the Lyons ReadyCare and Sysco Imperial brand names. The top of the carton has printing that identifies the Lot Code and Best By Date for these products. A chart listing all recalled products is provided below. The recall is being conducted in cooperation with Prairie Farms, Sysco, and the U.S. Food and Drug Administration. According to a statement from the U.S. Food and Drug Administration, there have been 38 illnesses associated with the strain ofListeria monocytogenesthat may have contaminated these products, including 11 deaths. Anyone who has a recalled product in his or her possession should quarantine the recalled products. Consumers with questions may visit the Lyons Magnus website atwww.lyonsmagnus.comfor more information or contact us atfrozenshakerecall@lyonsmagnus.com. The recalled products are:",
        "product_images": [],
        "product_details": {
            "Company Announcement Date": "February 22, 2025",
            "FDA Publish Date": "February 23, 2025",
            "Product Type": "Food & BeveragesFoodborne Illness",
            "Reason for Announcement": "Recall Reason DescriptionPossible Listeria monocytogenes contamination",
            "Company Name": "Lyons Magnus LLC",
            "Brand Name": "Brand Name(s)ReadyCare, Imperial",
            "Product Description": "Product DescriptionFrozen supplemental shakes"
        }
    }
]